eisup_2019_docmng_integration/src/BusinessProcesses/абсСогласованиеКонтрагентов/абсСогласованиеКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>абсСогласованиеКонтрагентов</name>
  <task>Task.абсЗадачаДоговора</task>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнициаторБП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

eisup_2019_docmng_integration/src/InformationRegisters/РолиИИсполнители/РолиИИсполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиИИсполнители</name>
  <resources>
    <name>абс_ИндексИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абсСтатусыКонтрагентов/абсСтатусыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыКонтрагентов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>ЗавершениеОтношений</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПереутверждение</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СменаРеквизитов</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйКонтроль</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсСтатусыДоговоров/абсСтатусыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыДоговоров</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДФМ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПервоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Закрытие</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДВКУР</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаКонтрагента</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПВП</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаРеквизитовДоговора</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДСменаОтветственного</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДИБ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭБ</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСогласованиеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДирКСП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемПД</name>
  </enumValues>
  <enumValues>
    <name>ОдобрениеСДилиОСА</name>
  </enumValues>
  <enumValues>
    <name>Корректировка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФКПослеКоррректировки</name>
  </enumValues>
  <enumValues>
    <name>ОтказПослеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехБлоком</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАудитором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеПДМКР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДСиМТО</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеТехническимДиректором</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеКазначейством</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеДТПиР</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеАД</name>
  </enumValues>
  <enumValues>
    <name>ttk_ВалютныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>ttk_СогласованиеЦФК</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсТипыДоговоров/абсТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсТипыДоговоров</name>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСоглашение</name>
  </enumValues>
  <enumValues>
    <name>Приложение</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОКонфиденциальности</name>
  </enumValues>
  <enumValues>
    <name>ДоговорТрехсторонний</name>
  </enumValues>
  <enumValues>
    <name>ГосударственныйКонтракт</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_ТипыСоглашенийОКонфиденциальности/абс_ТипыСоглашенийОКонфиденциальности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ТипыСоглашенийОКонфиденциальности</name>
  <enumValues>
    <name>Типовое</name>
  </enumValues>
  <enumValues>
    <name>Нетиповое</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ttk_СостоянияСуществованияКонтрагента/ttk_СостоянияСуществованияКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ttk_СостоянияСуществованияКонтрагента</name>
  <enumValues>
    <name>КонтрагентЕстьВБазеФНС</name>
  </enumValues>
  <enumValues>
    <name>НеДействуетИлиИзмененКПП</name>
  </enumValues>
  <enumValues>
    <name>КонтрагентОтсутствуетВБазеФНС</name>
  </enumValues>
  <enumValues>
    <name>КонтрагентСодержитОшибкиВДанных</name>
  </enumValues>
  <enumValues>
    <name>КППНеСоответствуетДаннымБазыФНС</name>
  </enumValues>
  <enumValues>
    <name>КонтрагентНеПодлежитПроверке</name>
  </enumValues>
  <enumValues>
    <name>ПустойИННИлиКПП</name>
  </enumValues>
  <enumValues>
    <name>НеверныйИНН</name>
  </enumValues>
  <enumValues>
    <name>НевернаяДлинаИНН</name>
  </enumValues>
  <enumValues>
    <name>НевернаяДлинаКПП</name>
  </enumValues>
  <enumValues>
    <name>ИПНеМожетИметьКПП</name>
  </enumValues>
  <enumValues>
    <name>НевернаяДата</name>
  </enumValues>
  <enumValues>
    <name>НедопустимыеСимволыВИНН</name>
  </enumValues>
  <enumValues>
    <name>НедопустимыеСимволыВКПП</name>
  </enumValues>
  <enumValues>
    <name>НекорректныйФорматДаты</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЗапроса</name>
  </enumValues>
  <enumValues>
    <name>КонтрагентЗарегистрированВБазеФНСНоНеДействует</name>
  </enumValues>
  <enumValues>
    <name>КонтрагентЗарегистрированВБазеФНСНоУказанНеверныйКПП</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/РолиИсполнителей/РолиИсполнителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиИсполнителей</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеИспользуется</name>
      <description>_Не используется</description>
    </items>
    <items>
      <name>СогласованиеДоговоровПодрядаНеИСП</name>
      <description>(Не исп.) Согласование договоров подряда</description>
    </items>
    <items>
      <name>Бухгалтерия</name>
      <description>Бухгалтерия</description>
    </items>
    <items>
      <name>ДФМ</name>
      <description>ДФМ</description>
    </items>
    <items>
      <name>НастройкаПрав</name>
      <description>Настройка прав</description>
    </items>
    <items>
      <name>НачислениеРНПД</name>
      <description>Начисление РНПД</description>
    </items>
    <items>
      <name>ОбщиеРоли</name>
      <description>Общие роли</description>
    </items>
    <items>
      <name>Поддержка</name>
      <description>Поддержка</description>
    </items>
    <items>
      <name>ПроектныйУчет</name>
      <description>Проектный учет</description>
    </items>
    <items>
      <name>РаботаСДоговорами</name>
      <description>Работа с договорами</description>
    </items>
    <items>
      <name>РолиИСУЗК</name>
      <description>Роли ИСУЗК</description>
    </items>
    <items>
      <name>СогласованиеАктовПриёмкиВыполненныхРабот</name>
      <description>Согласование актов приёмки выполненных работ</description>
    </items>
    <items>
      <name>СогласованиеБюджета</name>
      <description>Согласование бюджета</description>
    </items>
    <items>
      <name>СогласованиеДоговоровПодряда</name>
      <description>Согласование договоров подряда</description>
    </items>
    <items>
      <name>ЗакупочныеЗаказыСчета</name>
      <description>Согласование закупочных заказов и счетов</description>
    </items>
    <items>
      <name>СогласованиеЗаявокНаОбеспечениеТМЦ</name>
      <description>Согласование заявок на обеспечение ТМЦ</description>
    </items>
    <items>
      <name>СогласованиеОС</name>
      <description>Согласование ОС</description>
    </items>
    <items>
      <name>ttk_Аудитор</name>
      <description>Аудитор</description>
    </items>
    <items>
      <name>БюджетныйКонтролер</name>
      <description>Бюджетный контролер</description>
    </items>
    <items>
      <name>ttk_ВалютныйКонтроль</name>
      <description>Валютный контроль</description>
    </items>
    <items>
      <name>ВводКЗР</name>
      <description>Ввод КЗР</description>
    </items>
    <items>
      <name>ВводОперацияБУНУ</name>
      <description>Ввод операция БУНУ</description>
    </items>
    <items>
      <name>УстановкаСоответствияАналитикВыручки</name>
      <description>Ввод соответствий аналитик выручки</description>
    </items>
    <items>
      <name>ДирККР</name>
      <description>Дир ККР</description>
    </items>
    <items>
      <name>ДирККРвКТТК</name>
      <description>Дир ККР в КТТК</description>
    </items>
    <items>
      <name>ttk_РуководительБП</name>
      <description>Начальник бюджетного планирования</description>
    </items>
    <items>
      <name>ОтказПоАвизо</name>
      <description>Отказ по авизо</description>
    </items>
    <items>
      <name>ОткрытиеДокументаИнтеграцияСHyperion</name>
      <description>Открытие и работа с документом Интеграция с hyperion</description>
    </items>
    <items>
      <name>ОформлениеАВЗ</name>
      <description>Оформление АВЗ</description>
    </items>
    <items>
      <name>Переутверждение</name>
      <description>Переутверждение</description>
    </items>
    <items>
      <name>ПроведениеППДБезКонтроляМаппинга</name>
      <description>Проведение ППД без контроля маппинга</description>
    </items>
    <items>
      <name>РедактированиеДатыРасходаЗРС</name>
      <description>Редактирование даты расхода ЗРС</description>
    </items>
    <items>
      <name>РедактированиеППДБезКонтроляДатыЗапрета</name>
      <description>Редактирование ППД без контроля даты запрета</description>
    </items>
    <items>
      <name>ttk_РуководительДБО</name>
      <description>Руководитель департамента бюджетирования и отчетности</description>
    </items>
    <items>
      <name>РуководительДК</name>
      <description>Руководитель ДК</description>
    </items>
    <items>
      <name>РуководительПД</name>
      <description>Руководитель ПД</description>
    </items>
    <items>
      <name>СогласованиеДИБ</name>
      <description>Согласование ДИБ</description>
    </items>
    <items>
      <name>СогласованиеДРСД</name>
      <description>Согласование ДРСД</description>
    </items>
    <items>
      <name>СогласованиеДРУ</name>
      <description>Согласование ДРУ</description>
    </items>
    <items>
      <name>СогласованиеДУП</name>
      <description>Согласование ДУП</description>
    </items>
    <items>
      <name>СогласованиеДЭБ</name>
      <description>Согласование ДЭБ</description>
    </items>
    <items>
      <name>ttk_СогласованиеЗакупкиМКР</name>
      <description>Согласование Закупки МКР</description>
    </items>
    <items>
      <name>СогласованиеКонтрагентовЮристами</name>
      <description>Согласование контрагентов юристами</description>
    </items>
    <items>
      <name>СогласованиеКТТК</name>
      <description>Согласование КТТК (филиалы)</description>
    </items>
    <items>
      <name>СогласованиеПД</name>
      <description>Согласование ПД</description>
    </items>
    <items>
      <name>СогласованиеПЛ</name>
      <description>Согласование Первым лицом</description>
    </items>
    <items>
      <name>СогласованиеРекласификацииБюджетаДЭИ</name>
      <description>Согласование рекласификации бюджета (ДЭИ)</description>
    </items>
    <items>
      <name>СогласованиеРуководителяДКП</name>
      <description>Согласование руководителя ДКП</description>
    </items>
    <items>
      <name>СогласованиеРуководителяДОП</name>
      <description>Согласование руководителя ДОП</description>
    </items>
    <items>
      <name>СогласованиеСОКДЭБ</name>
      <description>Согласование СОК (ДЭБ)</description>
    </items>
    <items>
      <name>СогласованиеДВКУР</name>
      <description>Согласование ЦОЗД КТТК</description>
    </items>
    <items>
      <name>ttk_СогласованиеЦФК</name>
      <description>Согласование ЦФК</description>
    </items>
    <items>
      <name>СотрудникГруппыНСИ</name>
      <description>Сотрудник группы НСИ</description>
    </items>
    <items>
      <name>СотрудникДК</name>
      <description>Сотрудник ДК</description>
    </items>
    <items>
      <name>СотрудникСклада</name>
      <description>Сотрудник склада</description>
    </items>
    <items>
      <name>СуперПользователь</name>
      <description>Супер пользователь</description>
    </items>
    <items>
      <name>СуперПользовательДЗО</name>
      <description>Супер пользователь ДЗО</description>
    </items>
    <items>
      <name>ТипКонтрагентаМСФО</name>
      <description>Тип контрагента (МСФО)</description>
    </items>
    <items>
      <name>абс_ТрансфертноеЦенообразование</name>
      <description>Трансфертное ценообразование</description>
    </items>
    <items>
      <name>УстановкаПроектаСтатьи</name>
      <description>Установка проекта статьи</description>
    </items>
  </predefined>
  <attributes>
    <name>абс_РольИСУЗК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/BusinessProcesses/абсСогласованиеКонтрагентов/ObjectModule.bsl
// АБС 20101206 Изменена карта БП
// Удален блок проверки ПД, с проверки ДФМ БП проходит на согласование ДЭБ
// ВыборВариантаКонтрагентСогласованПД
// 1 - ВариантПроверкаДФМ
// 2 - ВариантОтказ
// 3 - ВариантСогласованиеДЭБ
// ДействиеСогласованиеПД

// Обработчики создания задач, в основном в них устанавливается исполнитель для конкретной задачи

// Обработка ПередСозданием ЗаполнениеКонтрагента
Процедура ЗаполнениеКонтрагентаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	ФормируемыеЗадачи.Очистить();
	
	НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
	
	НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
	НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
	НоваяЗадача.Дата 				= ТекущаяДата();

	//НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи + ", " + Строка(ЭтотОбъект.Ссылка.Контрагент);
	//
	НоваяЗадача.Наименование = СокрЛП(Контрагент.Наименование) + " "  
		+ ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
	
	НоваяЗадача.Исполнитель			= ПользовательИнициаторБП;
	
	НоваяЗадача.ОбъектЗадачи 		= Контрагент;
	
	НоваяЗадача.Записать();
	
	ФормируемыеЗадачи.Добавить(НоваяЗадача);
	
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, Контрагент, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
КонецПроцедуры

Процедура ДействиеОтказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	ФормируемыеЗадачи.Очистить();
	
	НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
	
	НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
	НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
	НоваяЗадача.Дата 				= ТекущаяДата();

	//НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи + ", " + Строка(ЭтотОбъект.Ссылка.Контрагент);
	//
	НоваяЗадача.Наименование = СокрЛП(Контрагент.Наименование) + " "  
		+ ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
	
	НоваяЗадача.Исполнитель			= ПользовательИнициаторБП;
	
	НоваяЗадача.ОбъектЗадачи 		= Контрагент;
	
	НоваяЗадача.Записать();
	
	ФормируемыеЗадачи.Добавить(НоваяЗадача);

	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, Контрагент, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	

	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
КонецПроцедуры

// Обработка ПередСозданием РаботаСКонтрагентом
Процедура ДействиеРаботаСКонтрагентомПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.абсНовыйКонтрагент.ТочкиМаршрута.ДействиеРаботаСКонтрагентом Тогда
		Для Каждого Задача Из ФормируемыеЗадачи Цикл
			Задача.Исполнитель = Задача.БизнесПроцесс.ПользовательИнициаторБП;
		КонецЦикла;		
	КонецЕсли;

КонецПроцедуры

// Процедуры формирования групповых задач
Процедура ПроверкаСотрудникомДФМПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
КонецПроцедуры

Процедура ПроверкаСотрудникомПДПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
КонецПроцедуры

Процедура ДействиеСогласованиеКонтрагентаСотрудникомДЭБПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
КонецПроцедуры

Процедура СформироватьГрупповуюЗадачу(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	
	ФормируемыеЗадачи.Очистить();
	
	// АБС ИЗМЕНЕНО Согласование ДЭБ ДЗО 20120318
	// Если в контрагенте заполнена организация инициатор контрагента, 
	// то разрешим ДЭБ организации согласовать контрагента
	// иначе согласование только ДЭБ КТТК
	ОрганизацииСогласования = Новый Массив;
	ОрганизацииСогласования.Добавить(Справочники.Организации.НайтиПоНаименованию("КТТК"));
	
	Если ЗначениеЗаполнено(Контрагент.абс_ОрганизацияИнициаторКонтрагента) И ТочкаМаршрута = БизнесПроцессы.абсСогласованиеКонтрагентов.ТочкиМаршрута.ДействиеСогласованиеДЭБ Тогда
		ОрганизацииСогласования.Добавить(Контрагент.абс_ОрганизацияИнициаторКонтрагента);
	КонецЕсли;
	
	ЗапросИсполнителей = Новый Запрос(
	"ВЫБРАТЬ
	|	РолиИИсполнители.Исполнитель
	|ИЗ
	|	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
	|ГДЕ
	|	РолиИИсполнители.Роль = &РольИсполнителей
	|	И РолиИИсполнители.Организация В(&СпОрганизаций)");
									  
	ЗапросИсполнителей.УстановитьПараметр("СпОрганизаций", ОрганизацииСогласования);
	
	// АБС ИЗМЕНЕНО Согласование ДЭБ ДЗО КОНЕЦ
									  
	РольИсполнителей = Неопределено;									  
	Если ТочкаМаршрута = БизнесПроцессы.абсСогласованиеКонтрагентов.ТочкиМаршрута.ДействиеПроверкаДФМ Тогда
		РольИсполнителей = Справочники.РолиИсполнителей.ПроверкаКонтрагентаДФМ;
// +++ввв 30.09.2016 г.
	ИначеЕсли ТочкаМаршрута = БизнесПроцессы.абсСогласованиеКонтрагентов.ТочкиМаршрута.ДействиеНалоговыйКонтроль Тогда
		РольИсполнителей = Справочники.РолиИсполнителей.НалоговыйКонтроль;
// ---ввв 30.09.2016 г.
	ИначеЕсли ТочкаМаршрута = БизнесПроцессы.абсСогласованиеКонтрагентов.ТочкиМаршрута.ДействиеСогласованиеДЭБ Тогда
		РольИсполнителей = Справочники.РолиИсполнителей.СогласованиеДЭБ;
	КонецЕсли;
	
	Если РольИсполнителей = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗапросИсполнителей.УстановитьПараметр("РольИсполнителей", РольИсполнителей);
	
	ВыборкаИсполнителей = ЗапросИсполнителей.Выполнить().Выбрать();
	
	//абс Изменение Урал 28.01.2014 Формирование одной задачи
	Если ВыборкаИсполнителей.Количество() Тогда
		НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
		
		НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
		НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрута;
// +++ввв 30.09.2016 г.
		Если ТипЗнч(ТочкаМаршрута)=Тип("ТочкаМаршрутаБизнесПроцессаСсылка.абсСогласованиеКонтрагентов") Тогда
			Если РольИсполнителей=Справочники.РолиИсполнителей.НалоговыйКонтроль Тогда
				НоваяЗадача.Организация=ОрганизацииСогласования[0];
			КонецЕсли;
		КонецЕсли;
// ---ввв 30.09.2016 г.
		НоваяЗадача.Дата 				= ТекущаяДата();
	
		//НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи + ", " + Строка(ЭтотОбъект.Ссылка.Контрагент);
		//
		НоваяЗадача.Наименование = СокрЛП(Контрагент.Наименование) + " "  
			+ ТочкаМаршрута.НаименованиеЗадачи + ".";
		
		НоваяЗадача.Роль = РольИсполнителей;
		
		НоваяЗадача.ОбъектЗадачи 		= Контрагент;
		
		НоваяЗадача.Записать();
		
		ФормируемыеЗадачи.Добавить(НоваяЗадача);
		
	КонецЕсли;
	//\\Абс Урал
	
	Если ФормируемыеЗадачи.Количество() = 0 Тогда
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найдено ответственных.", Отказ);
	КонецЕсли;
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, Контрагент, ТочкаМаршрута, ФормируемыеЗадачи);
	
КонецПроцедуры

// Процедуры Проверки условий и вариантов маршрута
Процедура УсловиеПроверкаДФМПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Контрагент.абс_СтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.ПроверкаДФМ;	
КонецПроцедуры

Процедура УсловиеАрихвПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Контрагент.абс_СтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Архив;
КонецПроцедуры

Процедура ВыборВариантаКонтрагентСогласованПДОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусКонтрагента = Контрагент.абс_СтатусКонтрагента; 
	
	Если ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантПроверкаДФМ;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СогласованиеДЭБ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДЭБ;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыборВариантаКонтрагентСогласованДЭБОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусКонтрагента = Контрагент.абс_СтатусКонтрагента; 
	
	Если ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантПроверкаДФМ;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СогласованиеДЭБ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДЭБ;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнениеКонтрагентаОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Если не заполнен контрагент, то он еще не создан в справочнике
	//  создадим его и дадим пользователю дозаполнить
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтрагент.Статус = Перечисления.абсСтатусыКонтрагентов.Подготовка;
		НовыйКонтрагент.Записать();
		
		Контрагент = НовыйКонтрагент.Ссылка;
		Записать();
	КонецЕсли;
	
	ОткрытьКонтрагента();
	
КонецПроцедуры

Процедура ОткрытьКонтрагента()
	
	ФормаНовогоКонтрагента = Контрагент.ПолучитьФорму("ФормаЭлемента");
	
	Если ФормаНовогоКонтрагента.Открыта() Тогда
		ФормаНовогоКонтрагента.Активизировать();
	Иначе
		ФормаНовогоКонтрагента.Открыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ДействиеПроверкаДФМОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ОткрытьКонтрагента();

КонецПроцедуры

Процедура ДействиеСогласованиеДЭБОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ОткрытьКонтрагента();

КонецПроцедуры

Процедура ДействиеОтказОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ОткрытьКонтрагента();

КонецПроцедуры

Процедура ДействиеСогласованиеПДПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ВыполнитьЗадачиПоТочкеБП(ТочкаМаршрутаБизнесПроцесса);
КонецПроцедуры

Процедура ВыполнитьЗадачиПоТочкеБП(ТочкаМаршрутаБизнесПроцесса)
	// Выполним остальные задачи на данной точке 
	ЗапросЗадач = Новый Запрос("ВЫБРАТЬ
	                           |	абсЗадачаДоговора.Ссылка
	                           |ИЗ
	                           |	Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
	                           |ГДЕ
	                           |	абсЗадачаДоговора.БизнесПроцесс = &БизнесПроцесс
	                           |	И абсЗадачаДоговора.ТочкаМаршрута = &ТочкаМаршрута
	                           |	И абсЗадачаДоговора.Выполнена = ЛОЖЬ");
	ЗапросЗадач.УстановитьПараметр("БизнесПроцесс", Ссылка);
	ЗапросЗадач.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрутаБизнесПроцесса);
	
	ВыборкаЗадач = ЗапросЗадач.Выполнить().Выбрать();
	
	Пока ВыборкаЗадач.Следующий() Цикл
		ЗадачаОбъект = ВыборкаЗадач.Ссылка.ПолучитьОбъект();
		
		ЗадачаОбъект.ВыполнитьЗадачу();
	КонецЦикла;
КонецПроцедуры

Процедура ВыборВариантаПроверкаДФМОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	ТекСтатус = Контрагент.абс_СтатусКонтрагента;
	
	Если ТекСтатус = Перечисления.абсСтатусыКонтрагентов.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	ИначеЕсли ТекСтатус = Перечисления.абсСтатусыКонтрагентов.Активный Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантКонтрагентИзБиллинга;
	ИначеЕсли ТекСтатус = Перечисления.абсСтатусыКонтрагентов.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантПроверкаДФМ;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗавершениеУспешноПроверенСогласованПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	// Закроем задачи проверки контрагента по договорам
	//***** АБС Вставка Гетц. 28.01.14. Оптимизация запроса
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//					  |	МАКСИМУМ(абсЗадачаДоговора.Ссылка) КАК Ссылка,
	//					  |	абсЗадачаДоговора.ОбъектЗадачи КАК ДоговорКонтрагента
	//					  |ИЗ
	//					  |	Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
	//					  |ГДЕ
	//					  |	абсЗадачаДоговора.ОбъектЗадачи ССЫЛКА Справочник.ДоговорыКонтрагентов
	//					  |	И абсЗадачаДоговора.ОбъектЗадачи.Владелец = &Контрагент
	//					  |	И абсЗадачаДоговора.ТочкаМаршрута = &ТочкаМаршрута
	//					  |	И абсЗадачаДоговора.Выполнена = ЛОЖЬ
	//					  |	И абсЗадачаДоговора.ОбъектЗадачи.абс_СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.абсСтатусыДоговоров.ПроверкаКонтрагента)
	//					  |
	//					  |СГРУППИРОВАТЬ ПО
	//					  |	абсЗадачаДоговора.ОбъектЗадачи");
						  
     Запрос = Новый Запрос("ВЫБРАТЬ
                           |	МАКСИМУМ(абсЗадачаДоговора.Ссылка) КАК Ссылка,
                           |	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента
                           |ИЗ
                           |	Задача.абсЗадачаДоговора КАК абсЗадачаДоговора
                           |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
                           |		ПО абсЗадачаДоговора.ОбъектЗадачи = ДоговорыКонтрагентов.Ссылка
                           |ГДЕ
                           |	абсЗадачаДоговора.ОбъектЗадачи ССЫЛКА Справочник.ДоговорыКонтрагентов
                           |	И ДоговорыКонтрагентов.Владелец = &Контрагент
                           |	И абсЗадачаДоговора.ТочкаМаршрута = &ТочкаМаршрута
                           |	И абсЗадачаДоговора.Выполнена = ЛОЖЬ
                           |	И ДоговорыКонтрагентов.абс_СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.абсСтатусыДоговоров.ПроверкаКонтрагента)
                           |
                           |СГРУППИРОВАТЬ ПО
                           |	абсЗадачаДоговора.ОбъектЗадачи,
                           |	ДоговорыКонтрагентов.Ссылка");
	//***** АБС Вставка Гетц. 28.01.14. Оптимизация запроса \\					  
						  
	Запрос.УстановитьПараметр("Контрагент"		, Контрагент);
	Запрос.УстановитьПараметр("ТочкаМаршрута"	, БизнесПроцессы.абсСогласованиеДоговоров.ТочкиМаршрута.ДействиеПроверкаКонтрагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// Сначала изменим статус в карточке договора
		// потом в регистре
		// потом выполним задачу
		ДоговорОбъект = Выборка.ДоговорКонтрагента.ПолучитьОбъект();
		
		НовыйСтатусДоговора = Неопределено;
		
		Если ДоговорОбъект.абс_ТипДоговора = Перечисления.абсТипыДоговоров.СоглашениеОКонфиденциальности Тогда
			
			Если ДоговорОбъект.абс_ТипСоглашенияОКонфиденциальности = Перечисления.абс_ТипыСоглашенийОКонфиденциальности.Типовое ИЛИ 
				 НЕ ЗначениеЗаполнено(ДоговорОбъект.абс_ТипСоглашенияОКонфиденциальности) Тогда
				 
					// 20110411 Типовые соглашения о конфиденциальности переходят из статуса "Подготовка" в статус "Подписание и регистрация"
					//НовыйСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеПД;
					НовыйСтатусДоговора = Перечисления.абсСтатусыДоговоров.Регистрация;
				 
			Иначе
				
				НовыйСтатусДоговора = Перечисления.абсСтатусыДоговоров.СогласованиеДИБ;
				
			КонецЕсли;
			 
		Иначе
			
			НовыйСтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ;
			
		КонецЕсли;
		
		ДоговорОбъект.абс_СтатусДоговора = Перечисления.абсСтатусыДоговоров.ПроверкаДФМ;
		
		ДоговорОбъект.абс_ПричинаИзмененияСтатуса = "Контрагент перешел в статус Активный";
		
		ДоговорОбъект.Записать();
		
	КонецЦикла;
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
	
КонецПроцедуры

Процедура ЗавершениеАрхивПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
КонецПроцедуры

Процедура УсловиеНеРезидентПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Истина; //Контрагент.НеЯвляетсяРезидентом;
КонецПроцедуры

Процедура ВыборВариантаДляНеРезидентаОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусКонтрагента = Контрагент.абс_СтатусКонтрагента; 
	
	Если ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СогласованиеПД Тогда //Если ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.НалоговыйКонтроль Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантНалоговыйКонтроль;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СогласованиеДЭБ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСогласованиеДЭБ;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;		
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.ПроверкаДФМ Тогда //Григорьев (Для физ. лиц)
		Результат = ТочкаВыбораВарианта.Варианты.ВариантПроверкаДФМ;
	КонецЕсли;

КонецПроцедуры

Процедура ДействиеНалоговыйКонтрольОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ОткрытьКонтрагента();

КонецПроцедуры

Процедура ДействиеНалоговыйКонтрольПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ);
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
КонецПроцедуры

Процедура ВыборВариантаНалоговыйКонтрольОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	
	ТекСтатусКонтрагента = Контрагент.абс_СтатусКонтрагента; 
	
	Если ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.ПроверкаДФМ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантПроверкаДФМ;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СогласованиеПД Тогда //ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.НалоговыйКонтроль Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантНалоговыйКонтроль;
	ИначеЕсли ТекСтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.Отказ Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	КонецЕсли;

КонецПроцедуры

Процедура ЗавершениеОтказПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	абс_БизнесПроцессыУведомления.ЗарегестрироватьУведомление(Ссылка, ТочкаМаршрутаБизнесПроцесса, Контрагент.абс_СтатусКонтрагента);
	
КонецПроцедуры

Процедура УсловиеПодготовкаНеРезидентПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Истина; //Контрагент.НеЯвляетсяРезидентом;
КонецПроцедуры

Процедура ВыборВариантаПроверкиОбработкаВыбораВарианта(ТочкаВыбораВарианта, Результат)
	йСтатусОтвета=Неопределено;	
	йСтрОшибки=""; //ОбщегоНазначенияСервер.ПроверкаКонтрагентаПоИННиКППнаИФНС(Контрагент.ИНН,Контрагент.КПП,йСтатусОтвета);
	мТекущийПользователь = глЗначениеПеременной("глТекущийПользователь");
	мРолиПользователя 	 = абс_БизнесПроцессы.ПолучитьСписокДоступныхРолейПользователя(мТекущийПользователь);
	Если ЗначениеЗаполнено(йСтрОшибки) Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУспешнаяПроверка; //ТочкаВыбораВарианта.Варианты.ВариантОшибкиСвязи;
	ИначеЕсли йСтатусОтвета = Перечисления.ttk_СостоянияСуществованияКонтрагента.КонтрагентЕстьВБазеФНС ИЛИ
			 йСтатусОтвета = Перечисления.ttk_СостоянияСуществованияКонтрагента.КППНеСоответствуетДаннымБазыФНС Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантУспешнаяПроверка;
	ИначеЕсли мРолиПользователя.Найти(Справочники.РолиИсполнителей.СуперПользователь)<>Неопределено Тогда
		Результат = ТочкаВыбораВарианта.Варианты.ВариантСуперПользователь;
	Иначе
		Результат = ТочкаВыбораВарианта.Варианты.ВариантОтказ;
	КонецЕсли;
КонецПроцедуры

Процедура УсловиеИсполнительСогласуетПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = (Контрагент.абс_СтатусКонтрагента = Перечисления.абсСтатусыКонтрагентов.СогласованиеДЭБ);
КонецПроцедуры
